In [1]:
import pandas as pd
import os
import sys

In [2]:
sys.path.append(os.path.abspath(os.path.join('../scripts')))

In [3]:
from utils import run_sql_query, populate_dataframe_to_database

In [4]:
# df = pd.read_csv('/home/babi/Desktop/10academy/Traffic-Analytics-Data-Warehouse-Airflow-dbt-Redash/data/US-101-LosAngeles-CA/vehicle-trajectory-data/0750am-0805am/trajectories-0750am-0805am.csv')

In [5]:
# df.head()

In [6]:
# df.info()

In [7]:
# df.dtypes

In [8]:
# df.shape

In [9]:
old_df = pd.read_csv("../data/dataset.csv", sep="[,;:]", index_col=False)

/tmp/ipykernel_114373/1193814888.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  old_df = pd.read_csv("../data/dataset.csv", sep="[,;:]", index_col=False)
/tmp/ipykernel_114373/1193814888.py:1: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  old_df = pd.read_csv("../data/dataset.csv", sep="[,;:]", index_col=False)

In [10]:
old_df.dtypes

track_id         int64
 type           object
 traveled_d    float64
 avg_speed     float64
 lat           float64
 lon           float64
 speed         float64
 lon_acc       float64
 lat_acc       float64
 time          float64
dtype: object

In [11]:
old_df.head()

,track_id,type,traveled_d,avg_speed,lat,lon,speed,lon_acc,lat_acc,time
0,1,Car,48.85,9.770344,37.977391,23.737688,4.9178,0.0518,-0.0299,0.0
1,2,Motorcycle,98.09,19.839417,37.977642,23.737400,16.9759,-0.0361,-0.0228,0.0
2,3,Motorcycle,63.80,18.228752,37.977997,23.737264,20.1906,-0.0795,-0.3395,0.0
3,4,Motorcycle,145.72,26.229014,37.978135,23.737072,2.7555,-0.0302,0.0948,0.0
4,5,Motorcycle,138.01,24.841425,37.978134,23.737103,0.0000,0.0000,0.0000,0.0

In [12]:
old_df.columns

Index(['track_id', ' type', ' traveled_d', ' avg_speed', ' lat', ' lon',
       ' speed', ' lon_acc', ' lat_acc', ' time'],
      dtype='object')

In [13]:
connection_params = {
    "host": "localhost",
    "user": "airflow",
    "password": "airflow",
    "port": "5432",
    "database": "airflow"  # Change to your desired database name
}

create_table_query =  '''CREATE TABLE IF NOT EXISTS vehicle_data (
    "track_id" bigint PRIMARY KEY,
    "type" text,
    "traveled_d" double precision,
    "avg_speed" double precision,
    "lat" double precision,
    "lon" double precision,
    "speed" double precision,
    "lon_acc" double precision,
    "lat_acc" double precision,
    "time" double precision
);
'''
table_name = "vehicle_data"

In [14]:
run_sql_query(connection_params, create_table_query)

Log success

In [15]:
old_df.columns

Index(['track_id', ' type', ' traveled_d', ' avg_speed', ' lat', ' lon',
       ' speed', ' lon_acc', ' lat_acc', ' time'],
      dtype='object')

In [16]:
# Check if all rows have the same column length
is_same_length = all(len(row) == len(old_df.columns) for _, row in old_df.iterrows())

if is_same_length:
    print("All rows have the same column length.")
else:
    print("Not all rows have the same column length.")

All rows have the same column length.

In [17]:
populate_dataframe_to_database(connection_params, old_df, table_name)

Inserted 922 rows into the database table vehicle_data.